# Brewfile — the declarative package manifest (see docs/adr/0001).
#
# Installed via `brew bundle` (run automatically by chezmoi on change).
# `brew bundle cleanup --file=~/.local/share/chezmoi/home/Brewfile` reports packages
# NOT listed here — removal is always manual, never automatic (grilling decision).

###############################################################################
# Command-line tools                                                          #
###############################################################################

brew "mas"           # Mac App Store CLI — keep first so mas apps below can install
brew "chezmoi"       # this repo's dotfile manager
brew "git"           # newer than the system Git
brew "git-lfs"       # Git large-file storage
brew "git-delta"     # syntax-highlighted git diff pager
brew "antidote"      # zsh plugin manager — replaces antigen
brew "direnv"        # per-directory environment variables
brew "mysql-client"  # MySQL CLI (keg-only)
brew "starship"      # cross-shell prompt — replaces powerlevel10k
brew "eza"           # modern ls (icons, git-aware, tree)
brew "zoxide"        # smart cd (`z`)
brew "fzf"           # fuzzy finder (Ctrl-R / Ctrl-T)
brew "bat"           # cat with syntax highlighting
brew "fd"            # fast, friendly find
brew "ripgrep"       # fast grep
brew "micro"         # modern terminal editor ($EDITOR)
brew "dockutil"      # manage macOS Dock items (used by the Dock provisioning script)
brew "php-cs-fixer"  # PHP code-style fixer
brew "jpegoptim"     # JPEG optimiser
brew "optipng"       # PNG optimiser
brew "imagemagick"   # image manipulation
brew "ffmpeg"        # audio/video transcoding
brew "gh"            # GitHub CLI (PRs, issues, releases)
brew "shellcheck"    # shell-script linter (matches CI lint step)
brew "gitleaks"      # secret scanner — pre-commit hook + CI gate (see ADR-0006)
brew "uv"            # fast Python package & version manager (Astral) — no global python pin
brew "gogcli"        # Google Workspace CLI
brew "opencode"      # AI coding agent CLI (homebrew-core)

###############################################################################
# Terminal & shell                                                            #
###############################################################################

cask "ghostty"                   # GPU-accelerated terminal — replaces iTerm2
cask "font-meslo-lg-nerd-font"   # Nerd Font for terminal glyphs (Starship/Ghostty)

###############################################################################
# Development                                                                 #
###############################################################################

cask "visual-studio-code"
cask "orbstack"      # fast Docker/Linux VMs — replaces Docker Desktop
cask "fork"          # Git GUI — replaces Sourcetree
cask "herd"          # Laravel Herd: bundled PHP + nginx — replaces Valet + php@8.0
cask "tableplus"     # database GUI

###############################################################################
# AI tools                                                                    #
###############################################################################

cask "claude-code"   # Claude Code — agentic coding CLI/app
cask "claude"        # Claude desktop app
cask "chatgpt"       # ChatGPT desktop app
cask "codex"         # OpenAI Codex

###############################################################################
# Voice & dictation                                                           #
###############################################################################

cask "wispr-flow"    # voice-to-text dictation with AI auto-editing
cask "fluidvoice"    # offline voice-to-text
cask "handy"         # speech-to-text

###############################################################################
# Design                                                                      #
###############################################################################

cask "figma"
cask "sketch"        # kept for legacy projects

###############################################################################
# Productivity                                                                #
###############################################################################

cask "raycast"       # launcher + clipboard history + window mgmt — replaces Magnet + Flycut
cask "1password"
cask "1password-cli" # required for chezmoi secret templates (see ADR-0002)
cask "notion"
cask "obsidian"      # Markdown knowledge base (its CLI PATH is set in ~/.zprofile)
cask "google-drive"
cask "clockify"
cask "mimestream"    # native Gmail client — replaces Spark
cask "home-assistant" # smart-home companion app

###############################################################################
# Communication                                                               #
###############################################################################

cask "slack"
cask "whatsapp"
cask "microsoft-teams"

###############################################################################
# Browsers                                                                    #
###############################################################################

cask "arc"           # default browser (see ~/.finicky.js routing)
cask "thebrowsercompany-dia"
cask "google-chrome"
cask "firefox@developer-edition"

###############################################################################
# Media                                                                       #
###############################################################################

cask "iina"          # media player

###############################################################################
# macOS utilities                                                             #
###############################################################################

cask "keka"          # file archiver
cask "kekaexternalhelper"
cask "finicky"       # per-URL browser routing (config in ~/.finicky.js)
cask "alt-tab"       # Windows-style window switcher with previews
cask "stats"         # system monitor in the menu bar
cask "itsycal"       # small menu-bar calendar

###############################################################################
# Mac App Store                                                               #
###############################################################################

mas "Keynote",   id: 361285480
mas "Numbers",   id: 361304891
mas "Pages",     id: 361309726
mas "WireGuard", id: 1451685025  # VPN client — App Store only, no cask

###############################################################################
# VS Code extensions — curated from scratch (best-practice set)               #
###############################################################################

# Editor quality of life
vscode "usernamehw.errorlens"                 # inline diagnostics
vscode "yoavbls.pretty-ts-errors"             # readable TypeScript errors
vscode "editorconfig.editorconfig"            # honour .editorconfig
vscode "eamodio.gitlens"                       # git blame / history
vscode "streetsidesoftware.code-spell-checker" # spell checking
vscode "pkief.material-icon-theme"            # file icons
vscode "formulahendry.auto-rename-tag"        # rename paired HTML/Blade/JSX tags (built-in linkedEditing deckt JSX/Blade nicht ab)
vscode "vivaxy.vscode-conventional-commits"   # guided conventional commit messages

# Format & lint (JS/TS/CSS)
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "stylelint.vscode-stylelint"           # CSS/SCSS linting

# DevOps & config
vscode "ms-azuretools.vscode-containers"      # container tooling (successor to vscode-docker)
vscode "github.vscode-github-actions"         # GitHub Actions workflow support
vscode "redhat.vscode-yaml"
vscode "mikestead.dotenv"
vscode "mechatroner.rainbow-csv"

# Stack: web / TS
vscode "bradlc.vscode-tailwindcss"            # Tailwind CSS IntelliSense
vscode "prisma.prisma"                        # Prisma ORM
vscode "graphql.vscode-graphql"               # GraphQL
vscode "graphql.vscode-graphql-syntax"        # Grammatik-Dependency von vscode-graphql (explizit gepinnt)

# Stack: PHP / Laravel
vscode "laravel.vscode-laravel"               # official Laravel extension
vscode "bmewburn.vscode-intelephense-client"  # PHP language server
vscode "amiralizadeh9480.laravel-extra-intellisense" # routes/views/config autocomplete
vscode "shufo.vscode-blade-formatter"         # Blade formatter (Highlighting kommt von laravel.vscode-laravel)
vscode "open-southeners.laravel-pint"         # Pint formatting

# Stack: Python
vscode "ms-python.python"                     # Python language support
vscode "ms-python.vscode-pylance"             # Pylance language server
vscode "ms-python.debugpy"                    # Python debugger
vscode "ms-python.vscode-python-envs"         # Env-Management, Teil des python extensionPack (explizit gepinnt)

# AI in the editor
vscode "anthropic.claude-code"                # Claude Code extension
vscode "openai.chatgpt"                       # ChatGPT extension
